[{"title":"建站日志","date":"2020-09-30T16:05:51.000Z","path":"2020/10/01/建站日志/","text":"建站日志一些记录。兼markdown写作练习。（Markdown和Typora，我滴新神！） 起源本站首建于2020年9月27日，距227事件爆发7个月整。 是时，AO3被墙，Lof自宫，肖战及其脑残粉猖獗依旧，同人爱好者们流离失所……这中间我受到的影响其实不算太大。也就是花钱买了个梯子，把lof屏蔽掉的文都搬去了ao3——反正我写文只为自己爽，从不在乎阅读量——然后就继续沉迷高达了。因为有几十部番要补，根本顾不上看同人。 半年后我们终于开学了，我也终于见到了刚从美帝回来的我导师，意识到自己离必须写代码搞生信的悲催未来不再遥远，而且我的糟糠妻旧电脑在导师面前频繁黑屏——于是我应急娶了个更适合带出门见人的小老婆，开始装各种有的没的软件，在多抓鱼买《R语言实战》的时候顺便凑了本《了不起的Markdown》，并在某节无聊的课上一口气看完。 那本书的倒数第二章讲的是“怎么用Github Pages和Hexo搭一个自己的博客”。 而那节课真的很无聊。所以我心想，为什么不呢？整一个，这就整一个！ 回来就开始装Node.js，装Git，注册Github，建仓库，买域名，解析，绑定……干完这些已经到了次日，而我才后知后觉地发现那天是927。 827我有个朋友给自家cp建了个论坛——是该叫论坛吗？这样说总像是回到了我刚学会上网看文、各家同人还都有自己的站子、比如纵横道之类的那个时代……我跟她还差得远，只会抄别人作业。但总算也磕磕绊绊地把这个个人博客整出来了。在这之前我可是个只在大学学过一学期C语言基础的电脑白痴啊。 227以来常有人说我们这些人是网络上的吉普赛人，被歧视，被压迫，被四处放逐……是的，我们的宅基地被收了，房子被拆了，但我们还可以给自己搭大篷车。我们会学习，会进步，不管有多少人试图拽着我们往后拖——比如肖某人的某些脑残粉。 他们只配继续堕落，和他们的蒸煮一道糊穿地心。 一些波折如前所述，我是个电脑白痴，抄命令符都能抄歪的那种，建这个博客全靠书和知乎上的一堆教程。尽管如此还是绊住好几次，踩了不少坑……真的，有些纯粹是因为我自己犯蠢…… 关于站名 作为一个鸦科厨、原英粉、兼热爱”冷“”黑“等用词的晚期中二病，“寒鸦”是我在各种观鸟活动中使用的自然名，“西敏寺寒鸦”则是用了很久的一个网名，转成英文就是westminstern jackdaw。像大多数鸟类的学名一样，很长，打出来可能也不太方便……？但我是不会道歉的！ 中文版的站名改了好几次，原本想叫“寒鸦飞过三千世界”或者“寒鸦飞过西敏寺顶”，但也都太长，侧边栏一行显示不下……最终才决定叫”寒鸦掠影“。化用了”惊鸿掠影“。 关于域名 购入 书上是在万网买的域名，但听说个人信息要备案，我很抗拒，就去了namesilo，结果五花八门的域名立刻晃花了我这个选择恐惧症患者的双眼……居然还有 .wtf ？！真的有人会买吗？ 最后选了 .cyou 的主要原因是便宜，一年1.29美元，换算成人民币也就8.79。而且勉强也可以赋个寓意，理解成“我们会在没有黑暗的地方相见”之类的……我很喜欢这句话的感觉。 目前只买了一年。看吧，明年说不定我就玩腻了呢？或者再换成0.99美元一年的 .buzz ，毕竟我确实很爱逼逼……寒鸦也确实和它们的其他鸦科亲戚一样，是种相当聒噪的鸟。 解析：这一步狠狠绊了我两跤 首先是在namesilo，“管理自己的域名，添加两条解析记录”； DNS记录很简单，把我的westminstern-jackdaw.github.io填进去就行了，没问题 然而A记录那条，我居然过了两天才想起来改……毕竟IPV4都是纯数字，而我对数字真的极其钝感…… 再回自己的github仓库，添加CNAME文件……我就在这被知乎一教程坑了。让我在source文件夹里“创建一个CNAME.txt文件，写进域名保存后重命名把.txt删掉”……我照做了，却发现这个.txt它·删·不·掉！ 于是我试着直接往github仓库里add file……一开始成功了，但是很神必，每隔一段时间这个CNAME文件都会自动消失，又要重来一遍……这期间我看了无数次404……不，不是MIU404那种好看的剧，而是字面上的“can’t find github page here”…… 我受不了了，老老实实翻回了书，才发现可以直接用命令在文件夹里建CNAME……？ 果断抄下代码。问题解决！ 关于主题给网站选主题的时候我在next和yilia-plus之间狠狠纠结了一会……前者用的人多，疑难解答肯定全，后者相对比较小众，但在我眼里就是要好看那么一点点……算了，就后者吧，毕竟强只是一时，帅可是一辈子……不行就改配置嘛！ ……很快我就后悔了。我真的会改配置吗，为什么我的Git Bash疯狂报错？为什么网页根本加载不出来？？ 低级错误之一：起初的我，竟然想把themes相关的代码强行加到根目录的_config.yml里（ 没办法，只能接着改：把改掉的一部分再改回来…… 总之、诞生宣言网站的成品暂时就这样。目前是简单按tag分类，但对于发文好像不太方便，我正在思考怎么把category体系也加上……慢慢来吧！要紧的是先把这篇文章发上来！ 如果（俗套地）把这个博客比作我的孩子，那么927就是“怀上它的日子”，今天才是正式的生辰——刚好赶在和国庆同一天。So, happy birthday！","link":"","tags":[{"name":"随笔","slug":"随笔","permalink":"http://example.com/tags/%E9%9A%8F%E7%AC%94/"}]},{"title":"Hello World","date":"2020-09-27T14:56:40.654Z","path":"2020/09/27/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"","tags":[]}]